In [1]:
import pandas as pd
import numpy as np

In [6]:
dict1 = {
    "name":['harry', 'rohan', 'skillful','shubh'],
    "marks":[92, 34, 24, 17],
    "city":['rampur', 'kolkata', 'bareilly', 'antarctica']
}

In [7]:
df = pd.DataFrame(dict1)

In [8]:
df

       name  marks        city
0     harry     92      rampur
1     rohan     34     kolkata
2  skillful     24    bareilly
3     shubh     17  antarctica

In [9]:
df.to_csv('friends.csv')